{
    "nav.home" : "Home",
    "nav.wagglebum" : "Wagglebum Studios",
    "nav.resume" : "Resume (CV)",
    "nav.shuttle" : "Unity Shuttle Run Game",
    "nav.solitaire" : "Solitaire Game + Custom Engine",
    "nav.klusters" : "Klusters iOS App",
    "nav.about" : "About me..",
    "nav.unreal" : "Unreal Shuttle Run Game",
    "page.home.button" : "Go home",
    "resume.summary" : "Highly technical and hands-on manager with a wide range of experience over multiple platforms and technologies. Skilled in all facets of product development life cycle from requirements gathering, analysis and conceptual design through architecture, program management, implementation, and ongoing support.",
    "resume.link.title" : "Document Version",
    "resume.link.summary" : "View a copy of my latest resume with the option to download and print it.",
    "resume.download.button" : "Open",
    "shuttle.summary" : "Created this project to help me learn 3D modeling and game development. I made the game content/models using Blender and then used those in developing a game in Unity for mobile and desktop.",
    "shuttle.reference.title" : "Shuttle Reference Images ",
    "shuttle.reference.summary" : "I used reference images from the internet to help me create the Star Trek shuttle model.",
    "shuttle.modeling.title" : "Blender 3D Modeling",
    "shuttle.modeling.summary" : "Using blender I created one of the main assets of the game...the shuttle. I picked one of the simple shuttles from Star Trek: The Next Generation since I was just learning how to use blender and didn't want to go too crazy. I did the modeling, texturing, and rigging (animate the doors opening).",
    "shuttle.video.title" : "Rendered Test Video of Shuttle",
    "shuttle.video.summary" : "I created a test video of the shuttle to see how it would look in a scene. I used blender to animate and render the video.",
    "shuttle.game.title" : "Unity 3D Shuttle Run Game",
    "shuttle.game.summary" : "Using the shuttle model and a few other small ones I created along with a few free items from the Unity store I was able to create a game using Unity 3D. This is not intended for sale or wide distribution...it was only created as a learning project. All of the Star Trek names and sounds are copyright of Paramount.",
    "shuttle.tryit.button" : "Try it out!",
    "shuttle.gameplay.title" : "Game Play Instructions",
    "shuttle.gameplay.summary" : "Use the arrow keys or WASD keys to steer. Once you start the game you will need to click on the thrust (Q or E keys also) to go forward and exist the shuttle bay. Search the asteroid field for asteroids that contain dilithim....which will look like blue crystals on the rocks. Once you get close enough the shuttle will automatically mine the crystals for you. When you have the dilithim bar full at the bottom of the screen you will need to return to the shuttle bay to win!",
    "solitaire.summary" : "Experimental project to try and build a game engine using the HTML canvas. Built the basics for the game engine and this sample game to test all the areas like the gaming loop, collisions, and other game events.",
    "solitaire.about.title" : "About the Game",
    "solitaire.about.summary" : "One of the main goals was to try and create a light-weight web based game engine that could easily be used to create basic 2D games that would work in Microsoft Teams.",
    "solitaire.tryit.button" : "Try it out!",
    "solitaire.source.button" : "Source code",
    "klusters.summary" : "This is a free iOS application for both iPhone and iPad that I use as a learning tool to keep me up to date with developing Apple apps.",
    "klusters.about.title" : "About the App",
    "klusters.about.summary" : "Trying to keep up to date but you know...distractions of other projects. Create lists of items, tasks, collections, or whatever you can think of to help organize the world around you. Use the kluSters application to build a customized list of items with whatever data values you would like for each item by using the form-like builder. Include values like text, numbers, tags, images, colors, multiple selection, barcodes, and more. Its very dynamic giving you the ability to create a list of items with all the right information you would like to use to describe each item the way you want.\\nLists can be searched, grouped, filtered, synced, and exported. Search, sort, and filter within each of your custom collections to find and organize items the way you would like to see them. Using your Dropbox account, you can synchronize your data between devices. Export your items and images to Dropbox or iTunes in CSV format to be used in your favorite spreadsheet application or whatever you may choose. This has been a pet project of mine for a few years which started as an app I wanted to catalog some collectables of mine but couldn't find something that was customizable enough. Finally, getting it out there and hope you like it.",
    "klusters.app.button" : "iOS App Store",
    "unreal.summary" : "Creating a test game using the Unreal Engine 5 to learn more about the development flow. This is a work in progress and will be updated over time.",
    "about.summary" : "General information about me and my background."
}